app/controllers/clientes_controller.rb

  def index
    @clientes = Cliente.all
---
SELECT `clientes`.* FROM `clientes`

  def show
    @cliente = Cliente.find(params[:id])
---
SELECT `clientes`.* FROM `clientes` WHERE `clientes`.`id` = 1 LIMIT 1

  def edit
    @cliente = Cliente.find(params[:id])
---
SELECT `clientes`.* FROM `clientes` WHERE `clientes`.`id` = 1 LIMIT 1

  def create
    @cliente = Cliente.new(params[:cliente])

    respond_to do |format|
      if @cliente.save
---
INSERT INTO `clientes` (`apelido`, `bairro`, `celular`, `cep`, `cidade`, `complemento`, `cpf`, `created_at`, `email`, `empresa_id`, `endereco`, `estado`, `nome`, `observacao`, `rg`, `sobrenome`, `telefone`, `updated_at`) VALUES ('', '', '', '09940300', 'Diadema', '', '', '2013-04-24 01:19:21', 'negociacaoweb@gmail.com', NULL, 'Av. Almiro Senna, 564', 'São Paulo', 'Daniel', '', '', 'Sousa', '(11) 4075-3510', '2013-04-24 01:19:21')

  def update
    @cliente = Cliente.find(params[:id])

    respond_to do |format|
      if @cliente.update_attributes(params[:cliente])
---
SELECT `clientes`.* FROM `clientes` WHERE `clientes`.`id` = 1 LIMIT 1
UPDATE `clientes` SET `email` = 'teste@gmail.com', `updated_at` = '2013-04-24 00:06:17' WHERE `clientes`.`id` = 2

  def destroy
    @cliente = Cliente.find(params[:id])
    @cliente.destroy
---
SELECT `clientes`.* FROM `clientes` WHERE `clientes`.`id` = 3 LIMIT 1
DELETE FROM `clientes` WHERE `clientes`.`id` = 3