app/controllers/empresas_controller.rb

  def index
    @empresas = Empresa.page(params[:page]).per(NUMERO_POR_PAGINA)
---
SELECT `empresas`.* FROM `empresas`

  def show
    @empresa = Empresa.find(params[:id])
---
SELECT `empresas`.* FROM `empresas` WHERE `empresas`.`id` = 1 LIMIT 1

  def create
    @empresa = Empresa.new(params[:empresa])

    respond_to do |format|
      if @empresa.save
---
INSERT INTO `empresas` (`bairro`, `cep`, `cidade`, `cnpj`, `complemento`, `created_at`, `endereco`, `estado`, `nome`, `nome_fantasia`, `observacao`, `telefone`, `updated_at`) VALUES ('', '', '', '455464654', '', '2013-04-24 01:20:55', '', '', 'Autometal', 'Autometal', '', '(11) 2516-5166', '2013-04-24 01:20:55')