app/controllers/funcionarios_controller.rb

  def index
    @funcionarios = Funcionario.page(params[:page]).per(NUMERO_POR_PAGINA)
---
SELECT `funcionarios`.* FROM `funcionarios`