app/controllers/oss_controller.rb

SELECT `produtos`.* FROM `produtos` WHERE `produtos`.`id` = 1 LIMIT 1
---
  def create
    params[:os][:desconto].gsub!("R$ ", "")
    params[:os][:desconto].gsub!(/\./, "")
    params[:os][:desconto].gsub!(/,/, ".")
    params[:os][:desconto] = params[:os][:desconto].to_f
    puts "ITENS #{params[:os][:itens_attributes].inspect} ================================"

    valor_total = 0

    params[:os][:itens_attributes].each do |item|
      puts "ITENS #{item.inspect} ================================"
      produto = Produto.find item[1][:produto_id]

INSERT INTO `oss` (`arquivo`, `created_at`, `data_entrega`, `desconto`, `esta_pago`, `estado`, `observacao`, `prioridade`, `updated_at`, `valor_restante`, `valor_total`) VALUES ('C://falskjfasj', '2013-04-23 22:37:35', '2013-04-23', 25.0, 0, 'OK', 'observação mano', 1, '2013-04-23 22:37:35', 48.5, 78.8)
---
    @os = Os.new(params[:os])

    respond_to do |format|
      if @os.save