app/controllers/produtos_controller.rb

  def index
    @produtos = Produto.page(params[:page]).per(NUMERO_POR_PAGINA)
---
SELECT `produtos`.* FROM `produtos`

  def show
    @produto = Produto.find(params[:id])
---
SELECT `produtos`.* FROM `produtos` WHERE `produtos`.`id` = 1 LIMIT 1

  def edit
    @produto = Produto.find(params[:id])
---
SELECT `produtos`.* FROM `produtos` WHERE `produtos`.`id` = 1 LIMIT 1

  def create
    @produto = Produto.new(params[:produto])

    respond_to do |format|
      if @produto.save
---
INSERT INTO `produtos` (`altura`, `comprimento`, `created_at`, `custo_unitario`, `descricao`, `nome`, `preco_unitario`, `unidade`, `updated_at`) VALUES (0.7, NULL, '2013-04-24 03:32:27', 10.0, '', 'Faixa 70cm', 25.0, 'Metro Comprimento', '2013-04-24 03:32:27')

  def update
    @produto = Produto.find(params[:id])

    respond_to do |format|
      if @produto.update_attributes(params[:produto])
---
SELECT `produtos`.* FROM `produtos` WHERE `produtos`.`id` = 1 LIMIT 1
UPDATE `produtos` SET `descricao` = 'Faixa normal com altura de 70cm', `preco_unitario` = 25.0, `custo_unitario` = 10.0, `altura` = 70.0, `updated_at` = '2013-04-26 03:09:59' WHERE `produtos`.`id` = 1